# pip install pandas

In [1]:
import pandas as pd

In [2]:
pd.DataFrame([1, 2, 3, 4, 5])

   0
0  1
1  2
2  3
3  4
4  5

In [3]:
pd.DataFrame({"valori":[1, 2, 3, 4, 5]})

   valori
0       1
1       2
2       3
3       4
4       5

In [6]:
df = pd.DataFrame({"valori":[1, 2, 3, 4, 5], "culori":["rosu", "negru", "verde", "mov", "azur"], "nuluri":[None] * 5})
df

   valori culori nuluri
0       1   rosu   None
1       2  negru   None
2       3  verde   None
3       4    mov   None
4       5   azur   None

In [9]:
df["culori"]

0     rosu
1    negru
2    verde
3      mov
4     azur
Name: culori, dtype: object

In [10]:
df = pd.DataFrame({"valori":[1, 2, 3, 4, 5], "culori":["rosu", "negru", "verde", "mov", "azur"], "zile":["luni", "marti", "miercuri", "joi", "vineri"]})
df

   valori culori      zile
0       1   rosu      luni
1       2  negru     marti
2       3  verde  miercuri
3       4    mov       joi
4       5   azur    vineri

In [11]:
df.head(2)

   valori culori   zile
0       1   rosu   luni
1       2  negru  marti

In [12]:
df.tail(2)

   valori culori    zile
3       4    mov     joi
4       5   azur  vineri

In [ ]:
df = pd.DataFrame({"valori":[1, 2, 3, 4, 5], "culori":["rosu", "negru", "verde", "mov", "azur"], "zile":["luni", "marti", "miercuri", "joi", "vineri"]})
df

   valori culori      zile
0       1   rosu      luni
1       2  negru     marti
2       3  verde  miercuri
3       4    mov       joi
4       5   azur    vineri

In [14]:
df.loc[2:3]

   valori culori      zile
2       3  verde  miercuri
3       4    mov       joi

In [15]:
df.loc[2:]

   valori culori      zile
2       3  verde  miercuri
3       4    mov       joi
4       5   azur    vineri

In [16]:
df[["culori", "zile"]]

  culori      zile
0   rosu      luni
1  negru     marti
2  verde  miercuri
3    mov       joi
4   azur    vineri

In [17]:
df[["culori", "zile"]][2:3]

  culori      zile
2  verde  miercuri

In [18]:
df[["culori", "zile"]][2:4]

  culori      zile
2  verde  miercuri
3    mov       joi

In [19]:
df["dimensiuni"] = [90, 60, 90, 78, 55]

In [20]:
df

   valori culori      zile  dimensiuni
0       1   rosu      luni          90
1       2  negru     marti          60
2       3  verde  miercuri          90
3       4    mov       joi          78
4       5   azur    vineri          55

In [21]:
df[ df["dimensiuni"] > 60]

   valori culori      zile  dimensiuni
0       1   rosu      luni          90
2       3  verde  miercuri          90
3       4    mov       joi          78

In [22]:
df.describe()

         valori  dimensiuni
count  5.000000    5.000000
mean   3.000000   74.600000
std    1.581139   16.456002
min    1.000000   55.000000
25%    2.000000   60.000000
50%    3.000000   78.000000
75%    4.000000   90.000000
max    5.000000   90.000000